Revit 2027 API
ContourSetting.DisableItem Method
 Disable a contour setting item of the current contour setting so that the item will not be used to draw contours.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DisableItem(
	ContourSettingItem item
)
Public Sub DisableItem (
	item As ContourSettingItem
)
public:
void DisableItem(
	ContourSettingItem^ item
)
member DisableItem :
        item : ContourSettingItem -> unit
Parameters
item ContourSettingItem
 The contour setting item to be disabled.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Contour setting will not be changed if the item could not be found.
See Also
Reference
ContourSetting Class
Autodesk.Revit.DB Namespace